#!/usr/bin/python
# Модуль для взаимодействия с Raspberry Pi (Тестовая версия!!!)
import inspect
import os
"""Проверака и комментари: 08.01.2019"""

"""
"Класс для работы программы в тестовом режиме под Windows"    
    self.ports - берем номера портов из config.ini
"""

class GPIO(object):
    """docstring"""

    """Конструктор класса. Поля класса"""
    def __init__(self, ports):
        # Список заявленных к работе портов
        self.ports = ports

    """Метод включаем подачу напряжения на указанный порт"""
    def port_on(self, port):
        # проверяем, что порт указан
        if port > 0:
            print('Включаем подачу напряжения на ' + str(port) + ' порт')

    """Метод отключает подачу напряжения на указанный порт"""
    def port_off(self, port):
        # проверяем, что порт указан
        if port > 0:
            print('Отключаем подачу напряжения на ' + str(port) + ' порт')

    """Метод отключает подачу напряжения на все заявленные к использованию порты"""
    def all_port_off(self):
        print('Отключаем подачу напряжения на все заявленные к использованию порты')

    """Метод для сбрасывания установки"""
    def clean_up(self):
        print('Сбрасываем сетап ')
